app/controllers/books_controller.rb

  def create
    # １. データを新規登録するためのインスタンス作成
    @book = Book.new(book_params)
    # ２. データをデータベースに保存するためのsaveメソッド実行
    if @book.save
    	redirect_to book_path(@book.id), notice:'Book was successfully created.'
    	else
    		@books=Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "あ"], ["body", "ああ"], ["created_at", "2020-08-11 07:30:23.641490"], ["updated_at", "2020-08-11 07:30:23.641490"]]
SELECT "books".* FROM "books"